export const JOB_POSITION = [
  {
    title: '프론트엔드 개발자',
    position: 'frontend_developer',
    highlight: '최적의 사용자 경험을 만드는 마법사입니다',
    detail:
      '프론트엔드 개발자는 웹 애플리케이션의 인터페이스를 구현하고 사용자 경험을 최적화하는 역할을 합니다. HTML, CSS, JavaScript를 사용하여 인터랙티브하고 반응형 웹 페이지를 만들어내며, 디자인과 기능성을 조화롭게 통합하는 능력이 요구됩니다.',
    label: '개발',
    imgUrl: '/images/programming.png',
    videoId: 'ceJMyCfYuwc'
  },
  {
    title: '백엔드 개발자',
    position: 'backend_developer',
    highlight: '데이터와 서버를 책임지는 든든한 지원군입니다',
    detail:
      '백엔드 개발자는 서버, 데이터베이스, 애플리케이션 로직을 관리하며 웹 애플리케이션의 핵심 기능을 구현합니다. 데이터 처리, API 개발, 서버 관리 등을 통해 사용자에게 신뢰성 있고 빠른 서비스를 제공하는 것이 주된 역할입니다.',
    label: '개발',
    imgUrl: '/images/back_end.png',
    videoId: '4pv6vJgr4gU'
  },
  {
    title: 'UI/UX 디자이너',
    position: 'ui_ux_designer',
    highlight: '시각적 디자인의 조화를 이루는 전문가입니다',
    detail:
      'UI/UX 디자이너는 사용자의 요구와 기대를 반영하여 인터페이스를 설계하고 최적의 사용자 경험을 제공합니다. 사용자 조사와 테스트를 통해 인사이트를 도출하고, 이를 바탕으로 직관적이고 아름다운 인터페이스를 디자인합니다. 사용자 흐름, 정보 구조, 시각적 요소를 통합하여 제품이 사용자에게 즐겁고 효율적인 경험을 제공하도록 하는 것이 주된 역할입니다.',
    label: '디자인',
    imgUrl: '/images/ui_ux_designer.png',
    videoId: 'pGB1trC8x5c'
  },
  {
    title: '프로덕트 디자이너',
    position: 'product_designer',
    highlight: '사용자 중심의 완벽한 제품을 설계하는 창조자입니다',
    detail:
      '프로덕트 디자이너는 제품의 전체적인 사용자 경험을 설계하고, 사용자 요구에 부합하는 기능적이고 아름다운 제품을 만들어냅니다. 사용자 조사, 프로토타이핑, 사용자 테스트를 통해 제품의 모든 측면을 최적화하는 것이 주된 역할입니다.',
    label: '디자인',
    imgUrl: '/images/product_designer.png',
    videoId: '9WmGat-8eNs'
  },
  {
    title: '서비스 기획자',
    position: 'service_planner',
    highlight: '최적의 서비스를 기획하는 전략가입니다',
    detail:
      '서비스 기획자는 사용자와 시장의 요구를 분석하여 최적의 서비스 전략을 수립하고 구현합니다. 시장 조사, 데이터 분석, 서비스 디자인 등을 통해 사용자의 요구를 충족시키는 서비스 경험을 제공하는 것이 주된 역할입니다.',
    label: '기획',
    imgUrl: '/images/service_planner.png',
    videoId: '_LuAV2-bqIo'
  },
  {
    title: '프로덕트 매니저',
    position: 'product_manager',
    highlight: '팀을 이끌어 성공적인 제품을 만드는 리더입니다',
    detail:
      '프로덕트 매니저는 제품 개발의 모든 단계를 관리하고 조정하여 성공적인 제품을 출시합니다. 제품 전략 수립, 프로젝트 관리, 팀 협업 등을 통해 제품의 비전과 목표를 달성하는 것이 주된 역할입니다.',
    label: '기획',
    imgUrl: '/images/product_manager.png',
    videoId: '1XlV1AJbXI8'
  }
];

export const questions = [
  '입사하여 첫 프로젝트에 참여하게 된 나. 팀에서 어떤 작업을 맡고 싶나요?',
  '나는 프로젝트를 진행하기 위해 어떤 도구를 사용할까요?',
  '새로운 프로젝트를 시작하기 전 가장 먼저 어떤 일을 할까요?',
  '프로젝트에 참여하게 되었습니다! 어떤 부분을 가장 신경 쓰며 진행해볼까요?',
  '프로젝트 도중 문제가 생겼습니다. 어떤 방식으로 문제를 해결해볼까요?',
  '중간 평가에서 피드백을 받았습니다. 가장 신경 쓰이는 피드백은 무엇인가요?',
  '프로젝트가 끝난 후 피드백을 받았습니다. 어떤 칭찬에 가장 기분이 좋았을까요?'
];

export const options = [
  [
    '1. 새로운 아이디어를 생각해내기',
    '2. 팀과 소통하며 프로젝트를 관리하기',
    '3. 멋진 디자인으로 프로젝트를 꾸미기',
    '4. 유저가 편하게 쓸 수 있게 화면을 디자인하기',
    '5. 페이지를 코딩으로 구현하기',
    '6. 유저의 정보를 기록하고 관리하기'
  ],
  [
    '1. 아이디어 정리하는 노트',
    '2. 프로젝트 관리 어플리케이션(Trello, Jira, Notion)',
    '3. 디자인 툴(Figma, Miro, Sketch)',
    '4. 코드 에디터(Visual Studio Code, WebStorm) ',
    '5. 프로토타이핑 툴(Pixso, Adobe XD, 스케치)',
    '6. 서버 관리 도구'
  ],
  [
    '1. 시장 조사',
    '2. 일정 계획 수립',
    '3. 디자인 스케치',
    '4. 사용자 요구사항 정리',
    '5. 초기 페이지 코딩',
    '6. 데이터 베이스 설계'
  ],
  [
    '1. 사업의 시장 조사와 기획',
    '2. 팀의 조화와 일정 관리',
    '3. 제품의 아름다움',
    '4. 사용자의 편의성',
    '5. 웹 페이지의 정확한 작동',
    '6. 서버의 안정성'
  ],
  [
    '1. 아이디어 회의를 통해 해결책 찾기',
    '2. 계획을 다시 세워 해결 방안 모색',
    '3. 새로운 화면 구조 디자인하기',
    '4. 사용자의 의견을 듣고 적용해보기',
    '5. 프로젝트의 알고리즘 다시 보기',
    '6. 데이터 분석을 통해 문제를 살펴보기'
  ],
  [
    '1. 아이디어가 더 참신했으면 좋겠다는 의견',
    '2. 일정 관리가 미흡하다는 지적',
    '3. 디자인이 더 세련되었으면 좋겠다는 피드백',
    '4. 사용자 편의성이 떨어진다는 불만',
    '5. 코드에 오류가 많다는 지적',
    '6. 서버가 불안정하다는 평가'
  ],
  [
    '1. 아이디어가 너무 좋다는 사업주의 칭찬',
    '2. 프로젝트 진행이 매끄러워 일하기 좋았다는 칭찬',
    '3. 화면이 예뻐서 자주보게 된다는 사용자의 칭찬',
    '4. 사이트가 사용하기에 너무 편하다는 SNS의 글',
    '5. 작동방식이 매끄러워 사용하기 좋다는 커뮤니티의 글',
    '6. 보안을 믿고 사용할 수 있다는 웹상의 글'
  ]
];

export const randomDecimals = [1.1, 1.01, 1.001, 1.0001, 1.00001, 1.000001, 1.0000001];
